In [1]:
import numpy as np
import pandas as pd

In [2]:
import os

In [3]:
os.listdir()

['.ipynb_checkpoints',
 'International Bank Account Numbers.ipynb',
 'Swift Codes.csv',
 'Transactions.csv']

In [4]:
trans = pd.read_csv("Transactions.csv")
codes = pd.read_csv("Swift Codes.csv")

In [5]:
trans.head()

   Transaction ID  Account Number Sort Code              Bank
0            3888        62230725  95-98-82  Data Source Bank
1            4746        83172326  42-86-38     Barclays Bank
2            5404        34302539  53-28-21     Barclays Bank
3            9013        13350031  93-87-71           Natwest
4            2535        68745993  57-14-32     Barclays Bank

In [9]:
trans["Sort Code"] = trans["Sort Code"].replace("-","",regex = True)

In [10]:
trans.head()

   Transaction ID  Account Number Sort Code              Bank
0            3888        62230725    959882  Data Source Bank
1            4746        83172326    428638     Barclays Bank
2            5404        34302539    532821     Barclays Bank
3            9013        13350031    938771           Natwest
4            2535        68745993    571432     Barclays Bank

In [11]:
codes.head()

            Bank SWIFT code Check Digits
0    Lloyds Bank       LOYD           C1
1  Barclays Bank       BARC           22
2        Halifax       HLFX           22
3           HSBC       HBUK           4B
4        Natwest       NWBK           2L

## Joing two Tables

In [12]:
df = pd.merge(trans,codes,how = "inner" , on= "Bank")

In [13]:
df.head()

,Transaction ID,Account Number,Sort Code,Bank,SWIFT code,Check Digits
0,3888,62230725,959882,Data Source Bank,DSBX,12
1,7086,56630552,597744,Data Source Bank,DSBX,12
2,1314,71210735,618579,Data Source Bank,DSBX,12
3,1493,12193988,865442,Data Source Bank,DSBX,12
4,1952,53786334,212754,Data Source Bank,DSBX,12

In [15]:
df["Country Code"] = "GB"

In [16]:
df.dtypes

Transaction ID     int64
Account Number     int64
Sort Code         object
Bank              object
SWIFT code        object
Check Digits      object
Country Code      object
dtype: object

In [22]:
df["Account Number"] = df["Account Number"].astype("str")

In [23]:
df.dtypes

Transaction ID     int64
Account Number    object
Sort Code         object
Bank              object
SWIFT code        object
Check Digits      object
Country Code      object
dtype: object

In [24]:
df["IBAN"] = df["Country Code"] + df["Check Digits"] + df["SWIFT code"] + df["Sort Code"] + df["Account Number"]

In [25]:
df_op = df[["Transaction ID","IBAN"]]

In [26]:
df_op.head()

   Transaction ID                    IBAN
0            3888  GB12DSBX95988262230725
1            7086  GB12DSBX59774456630552
2            1314  GB12DSBX61857971210735
3            1493  GB12DSBX86544212193988
4            1952  GB12DSBX21275453786334